# IdeaStatiCa.ConnectionApi.Model.ConNegativePlateOperation

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**MaterialId** | **int?** |  | [optional]
**Thickness** | **double** |  | [optional]
**Shape** | **ConPlateShape** |  | [optional]
**PolygonData** | **string** |  | [optional]
**Width** | **double** |  | [optional]
**Height** | **double** |  | [optional]
**Width2** | **double** |  | [optional]
**Height2** | **double** |  | [optional]
**Radius** | **double** |  | [optional]
**Positioning** | **ConPlatePositioning** |  | [optional]
**IsImported** | **bool** |  | [optional]
**OperationType** | **string** |  | [optional]
**Id** | **int** |  | [optional]
**Name** | **string** |  | [optional]
**Active** | **bool** |  | [optional]

[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)